{
    "name": "Monalisa",
    "category": "Reconstruction",
    "shortDescription": "MRI reconstruciton toolbox for non-Cartesian and Cartesian data. ",
    "imageFile": "monalisa_logo.png",
    "mainURL": "https://monalisarenaissance.github.io/monalisa/",
    "repoURL": "https://github.com/monalisaRenaissance/monalisa",
    "principalDevelopers": "Bastien Milani, Berk Can Açikgöz",
    "longDescription": "The Monalisa toolbox for MRI reconstruction has been originaly developed at CIBM-CHUV between 2018 and 2023 by Bastien Milani. It continued to evovled until now, notably by the contribution of Berk Can Açikgöz while working in QIS lab at Inselspital and university of Bern. Originally, the development of the toolbox began by the implementation of non-cartesian reconstructions. The first reconstruction implemented was a gridded reconstruction which is part of the static non-iterative familly. After that, some static iterative reconstruction were added and later 3D-CINE iterative reconstructions with temporal regularisation were implemented (4D and 5D), all for non-cartesian data. Iterative 3D-CINE reconstruction for cartesian data were then implemented on the same model. The toolbox was further enriched with GRAPPA implementations.",
    "keywords": [ "MRI, reconstruction, regularized, iterative, least-square, non-Cartesian, non-uniform" ],
    "keyReferences": [
        
        {
            "referenceText": "Free-running 3D-CINE MRI of patients with congenital heart disease using inter-bin compensation of cardiac motion",
            "referenceURL":  "https://archive.ismrm.org/2023/1083.html"
        },

        {
            "referenceText": "Improving 3D-CINE tTV-regularized whole-heart MRI reconstruction",
            "referenceURL":  "https://www.medrxiv.org/content/10.1101/2024.02.22.24302997v2"
        },

        {
            "referenceText": "Introducing Image-Space Preconditioning in the Variational Formulation of MRI Reconstructions",
            "referenceURL": "https://arxiv.org/abs/2507.05312"
        },

        {
            "referenceText": "Monalisa: An Open Source, Documented, User-Friendly MATLAB Toolbox for Magnetic Resonance Imaging Reconstruction",
            "referenceURL": "https://www.biorxiv.org/content/10.1101/2025.06.06.658299v1"
        }

    ],
    "extraResources": [
        {
            "resourceType": "",
            "URL": ""
        }
    ],
    "dateAddedToMRHub": "2025-12-21",
    "dateSoftwareLastUpdated": "2025-12-21",
    "citationSearchString": "https://doi.org/10.1101/2024.02.22.24302997",
    "citationCount": ""
},
