[

    {
        "name": "Berkeley Advanced Reconstruction Toolbox (BART)",
        "category": "Reconstruction",
        "shortDescription": "Reconstruction toolbox and programming library for parallel imaging and compressed sensing available for Linux, Mac OS X, and Windows.",
        "imageFile": "bart.png",
        "mainURL": "http://mrirecon.github.io/bart/",
        "principalDevelopers": "Martin Uecker, Jon Tamir and Frank Ong",
        "longDescription": "The Berkeley Advanced Reconstruction Toolbox (BART) is a free and open-source image- reconstruction framework for Computational Magnetic Resonance Imaging. It consists of a programming library (for C/C++) and a toolbox of command-line programs. The library provides common operations on multi-dimensional arrays, (non-uniform) Fourier and (divergence-free) wavelet transforms, as well as generic implementations of iterative optimization algorithms (CG, IST, FISTA, ADMM, IRGNM, ...) supporting various types of regularization terms (l2, l1-wavelet, total-variation, low-rank, multi-scale low-rank ...) using pre-defined functions. Parallel computation on multi-core systems and on Graphical Processing Units (GPUs) is supported. The command-line tools provide direct access to basic operations on multi-dimensional arrays as well as efficient implementations of many calibration and reconstruction algorithms for parallel imaging and compressed sensing (SENSE, ESPIRiT, NLINV, SAKE, ...).",
        "keywords": ["GitHub", "GPU", "ESPIRiT", "NUFFT", "iterative-reconstrution", "compressed sensing", "non-Cartesian", "parallel imaging"],
        "keyReferences": [
            {
                "referenceText": "Martin Uecker, Peng Lai, Mark J. Murphy, Patrick Virtue, Michael Elad, John M. Pauly, Shreyas S. Vasanawala, and Michael Lustig. ESPIRiT - An Eigenvalue Approach to Autocalibrating Parallel MRI: Where SENSE meets GRAPPA. Magn Reson Med 2014; 71:990-1001",
                "referenceURL": "https://doi.org/10.1002/mrm.24751"
            },  
            
            {
                "referenceText": "Martin Uecker, Patrick Virtue, Frank Ong, Mark J. Murphy, Marcus T. Alley, Shreyas S. Vasanawala, and Michael Lustig. Software Toolbox and Programming Library for Compressed Sensing and Parallel Imaging. ISMRM Workshop on Data Sampling and Image Reconstruction, Sedona 2013",
                "referenceURL": "https://www.gwdg.de/~muecker1/toolbox.pdf"
            },
            
            {
                "referenceText": "Martin Uecker, Frank Ong, Jonathan I Tamir, Dara Bahri, Patrick Virtue, Joseph Y Cheng, Tao Zhang, and Michael Lustig. Berkeley Advanced Reconstruction Toolbox. Annual Meeting ISMRM, Toronto 2015, In Proc. Intl. Soc. Mag. Reson. Med. 23:2486",
                "referenceURL": "http://index.mirasmart.com/ismrm2015/PDFfiles/2486.pdf"
            },

            {
                "referenceText": "Jonathan I Tamir, Frank Ong, Joseph Y Cheng, Martin Uecker, and Michael Lustig. Generalized Magnetic Resonance Image Reconstruction using The Berkeley Advanced Reconstruction Toolbox. ISMRM Workshop on Data Sampling and Image Reconstruction, Sedona 2016",
                "referenceURL": "https://www.gwdg.de/~muecker1/sedona16-bart.pdf"
            },
            
            {
                "referenceText": "Martin Uecker. Machine Learning Using the BART Toolbox - Implementation of a Deep Convolutional Neural Network for Denoising. Joint Annual Meeting ISMRM-ESMRMB, Paris 2018, In Proc. Intl. Soc. Mag. Reson. Med. 26;2802",
                "referenceURL": "http://indexsmart.mirasmart.com/ISMRM2018/PDFfiles/2802.html"
            }
            
        ],
        "extraResources": [
            {
                "resourceType": "",
                "URL": ""
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20190506",
        "citationSearchString": "Berkeley Advanced Reconstruction Toolbox",
        "citationCount": "136"
    },
    
    
    {
        "name": "Gadgetron",
        "category": "Reconstruction",
        "shortDescription": "General-purpose, open source, medical imaging reconstruction framework.",
        "imageFile": "gadgetron.png",
        "mainURL": "http://gadgetron.github.io/",
        "principalDevelopers": "David Christoffer Hansen, Adrienne Campbell-Washburn",
        "longDescription": "The Gadgetron is an Open Source, general-purpose medical imaging reconstruction framework written primarily in C++. It consists of two main components: 1) a set of versatile toolboxes for image signal processing, and 2) a modular, high performance framework for streaming data processing. The streaming framework uses a client server model where the reconstruction job is performed on a server and the client is responsible for sending data and receiving imaging. Clients can be stand-alone command line clients or an imaging device could serve as a client. The framework supports easy prototyping with scripting languages such as Python while supporting transparent integration in clinical work flows. For MRI applications, the Gadgetron supports the vendor independent ISMRM Raw Data format and it comes with high performance image reconstruction pipelines for many standard MRI sequences. Example applications include Cartesian and non-Cartesian parallel imaging, non-linear reconstruction and motion correction. Several performance critical components such as the non-Cartesian Fourier transform have been implemented on GPUs for improved performance. The framework can be used as a complete reconstruction package or the toolboxes can be leveraged in other applications.",
        "keywords": ["GitHub",  "Video tutorial", "GPU", "inline", "online", "streaming", "AI", "machine learning", "compressed sensing", "non-Cartesian","parallel imaging"],
        "keyReferences": [
            {
                "referenceText": "Hansen MS, Sørensen TS. Gadgetron: An Open Source Framework for Medical Image Reconstruction. Magn Reson Med. 2013 Jun;69(6):1768-76.",
                "referenceURL": "https://doi.org/10.1002/mrm.24389"
            } 
            
        ],
        "extraResources": [
            {
                "resourceType": "Video Tutorial",
                "URL": "https://www.youtube.com/watch?v=yLo4j5dQGhY"
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20190503",
        "citationSearchString": "Gadgetron",
        "citationCount": "199"        
    },

    {
        "name": "gpuNUFFT",
        "category": "Reconstruction",
        "shortDescription": "C++ CUDA accelerated non-uniform FFT for arbitrary 2D/3D data with direct Matlab interface on Windows and Linux",
        "imageFile": "gpunufft.png",
        "mainURL": "https://github.com/andyschwarzl/gpuNUFFT",
        "principalDevelopers": "Andreas Schwarzl, Florian Knoll",
        "longDescription": "The computational expensive non-uniform FFT is implemented in C++ by utilizing the NVIDIA CUDA architecture, in order to speed up the execution of the 2D/3D multi-coil Gridding step for arbitrarily shaped k-space data. The software offers a ready-to-use interface to Matlab, similar to the well-known NUFFT Toolbox by Fessler et al., in order to seamlessly enhance the preferred Matlab prototyping process at an early stage. The gpuNUFFT supports the growing importance of non-Cartesian 2D/3D trajectories in the context of iterative image reconstruction, parallel imaging, and compressed sensing by reducing the long computation times during NUFFT operations. Depending on the data size and shape, speedups up to a factor of 40 are possible.",
        "keywords": ["GitHub", "Video tutorial", "GPU", "NUFFT"],
        "keyReferences": [
            {
                "referenceText": "F. Knoll, A. Schwarzl, C. Diwoky, and D. Sodickson, gpuNUFFT - an open-source GPU Library for 3D Gridding with direct Matlab interfaceÓ, in Proceedings of the 22th Annual Meeting of ISMRM, Mailand, 2014 , p4297",
                "referenceURL": "https://cds.ismrm.org/protected/14MProceedings/files/4297.pdf"
            }
            
        ],
        "extraResources": [
            {
                "resourceType": "Video tutorial",
                "URL": "https://vimeo.com/161037263"
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20180130",
        "citationSearchString": "gpuNUFFT",
        "citationCount": "26"
    },    
    
    {
        "name": "ISMRMRD",
        "category": "Data format",
        "shortDescription": "Vendor-neutral MRI raw data format based on standard developed by a subcommittee of the ISMRM Sedona 2013 workshop",
        "imageFile": "ismrmrd",
        "mainURL": "http://ismrmrd.github.io/",
        "principalDevelopers": "<a href=\"http://ismrmrd.github.io/\"><em>See full list of developers.</em></a>",
        "longDescription": "A prerequisite for sharing MRI reconstruction software is a data format that describes typical MRI raw datasets in a vendor neutral manner. The ISMRM Raw Data format is a proposal for such a common MR raw data format, which promotes algorithm and data sharing. The file format consists of a flexible header and tagged frames of k-space data. These data elements are stored in an HDF5 file container. Application Programming Interfaces are available for C/C++, MATLAB, and Python. Converters for Bruker, General Electric, Philips, and Siemens proprietary file formats also available (implemented in C++). The proposed raw data format solves a practical problem for the magnetic resonance imaging community. It may serve as a foundation for reproducible research and collaborations. The ISMRM Raw Data format is a completely open and community-driven format, and the scientific community is invited (including commercial vendors) to participate either as users or developers.",
        "keywords": ["GitHub", "raw data", "k-space"],
        "keyReferences": [
            {
                "referenceText": "Inati SJ, Naegele JD, Zwart NR, Roopchansingh V, Lizak MJ, Hansen DC, et al. ISMRM Raw data format: A proposed standard for MRI raw datasets. Magn Reson Med. 2016; doi:10.1002/mrm.26089",
                "referenceURL": "https://doi.org/10.1002/mrm.26089"
            }
            
        ],
        "extraResources": [
            {
                "resourceType": "",
                "URL": ""
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20190510",
        "citationSearchString": "ISMRMRD",
        "citationCount": "21"
    },
    
    {
        "name": "Low Field Simulator",
        "category": "Simulation",
        "shortDescription": "This package is a MATLAB based tool for simulating low-field MRI acquisitions based on high-field acquisition, enables prediction of the minimum field strength requirements for a broad range of MRI techniques.",
        "imageFile": "lowfieldsim.png",
        "mainURL": "https://github.com/usc-mrel/lowfieldsim",
        "principalDevelopers": "Weiyi Chen, Ziyue Wu, Krishna S. Nayak",
        "longDescription": "<p>This package is to develop and evaluate a framework for simulating low-field proton-density weighted MRI acquisitions based on high-field acquisitions, which could be used to predict the minimum B0 field strength requirements for MRI techniques.</p><p>Given MRI raw data, lower field MRI acquisitions can be simulated based on the signal and noise scaling with field strength. Certain assumptions are imposed for the simulation. This package also contains two examples of proton-density weighted MRI applications that demonstrated estimation of minimum field strength requirements: real-time upper airway imaging and liver proton-density fat fraction measurement. More detailed description of the examples can be found in the published reference.</p><p>This package enables prediction of the minimum field strength requirements for a broad range of MRI techniques, and would be particularly useful in the evaluation of de-noising and constrained reconstruction techniques.</p>",
        "keywords": ["GitHub", "low field"],
        "keyReferences": [
            {
                "referenceText": "Z Wu, W Chen, KS Nayak. Minimum Field Strength Simulator for Proton Density Weighted MRI. PLOS ONE 11(5): e0154711. May 2016.",
                "referenceURL": "https://doi.org/10.1371/journal.pone.0154711"
            }, 
            
            {
                "referenceText": "Z Wu, W Chen, KS Nayak. Low-Field Simulation and Minimum Field Strength Requirements. ISMRM Workshop on Data Sampling and Image Reconstruction, Sedona, Arizona, Jan 2016.",
                "referenceURL": "http://cds.ismrm.org/protected/Data16/Program/Abstracts/Wu.pdf"
            } 
            
        ],
        "extraResources": [
            {
                "resourceType": "",
                "URL": ""
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20160712",
        "citationSearchString": "",
        "citationCount": ""
    },
    
    {
        "name": "Your package name",
        "category": "Choose from: Reconstruction // Data format // Educational // Simulation // Visiualisation // Spectroscopy // Image processing",
        "shortDescription": "One line description of your package",
        "imageFile": "image file name (with extension) - upload image itself into images_packages subfolder",
        "mainURL": "http://url.to.main.package",
        "principalDevelopers": "list of principal developers",
        "longDescription": "Longer description of the package - up to around 200 words.",
        "keywords": ["any", "keywords", "you", "like"],
        "keyReferences": [
            {
                "referenceText": "Text describing reference 1 (you may have as many references as you like in this list)",
                "referenceURL": "http://url.to.your.reference.1"
            }, 
            
            {
                "referenceText": "Text describing reference 2 (you may have as many references as you like in this list)",
                "referenceURL": "http://url.to.your.reference.2"
            } 
            
        ],
        "extraResources": [
            {
                "resourceType": "e.g. Video Tutorial / Jupyter Notebook / Blog description (you can have multiple resources in this list)",
                "URL": "http://url.to.this.resource"
            }
        ],
        "dateAddedToMRHub": "20190510",
        "dateSoftwareLastUpdated": "20190510",
        "citationSearchString": "",
        "citationCount": ""
    }
    
    

]